Repository: Akihiro-Arai/movies-connector
Catalog: MoviesConnector/Resources/Localizable.xcstrings
Source language: en
Languages: ja

# settings.title
source: Settings
ja: 設定

# settings.language
source: Language
ja: 言語

# settings.language.header
source: Display
ja: 表示

# settings.language.footer
source: Changes apply immediately to Movies Connector.
ja: 変更はすぐに Movies Connector に反映されます。

# language.system
source: System
ja: システム設定に合わせる

# ui.subtitle
source: Drop videos from Finder or Photos, or add them below. Order in the list is the join order.
ja: Finder や写真アプリから動画をドロップするか、下のボタンで追加してください。リストの順番が結合順です。

# ui.empty.title
source: Drop videos from Finder or Photos
ja: Finder や写真アプリから動画をドロップ

# ui.empty.hint
source: or use Add Videos
ja: または「動画を追加」を使用

# ui.empty.a11y
source: Drop videos from Finder or Photos, or use Add Videos
ja: Finder や写真アプリから動画をドロップするか、「動画を追加」を使用

# ui.output
source: Output
ja: 出力先

# ui.output.none
source: No output selected
ja: 出力先未選択

# ui.output.a11y %@
source: Output destination: %@
ja: 出力先: %@

# ui.choose
source: Choose…
ja: 選択…

# ui.choose.a11y
source: Choose output destination
ja: 出力先を選択

# ui.add_videos
source: Add Videos
ja: 動画を追加

# ui.cancel
source: Cancel
ja: キャンセル

# ui.cancel.a11y
source: Cancel join
ja: 結合をキャンセル

# ui.join
source: Join
ja: 結合

# ui.join.a11y
source: Join videos
ja: 動画を結合

# ui.join.hint.enabled
source: Starts lossless passthrough join
ja: 再エンコードなしで結合を開始します

# ui.join.hint.disabled
source: Disabled until the queue is ready
ja: キューの準備が整うまで無効です

# ui.progress.a11y
source: Join progress
ja: 結合の進捗

# ui.debug.title
source: Drop Debug Log
ja: ドロップデバッグログ

# ui.debug.copy
source: Copy
ja: コピー

# ui.debug.clear
source: Clear
ja: クリア

# ui.debug.placeholder
source: Drop a video (Finder or Photos). A full transcript will appear here — select text or use Copy.
ja: 動画をドロップするとここに詳細ログが表示されます。テキストを選択するか「コピー」を使えます。

# ui.loading
source: Loading…
ja: 読み込み中…

# ui.dropped_video
source: Dropped video
ja: ドロップした動画

# ui.status.inspecting
source: Inspecting…
ja: 検査中…

# ui.status.compatible
source: Compatible
ja: 互換

# ui.status.incompatible %@
source: Incompatible — %@
ja: 非互換 — %@

# ui.remove.help
source: Remove from queue
ja: キューから削除

# status.drop_empty
source: Could not read the dropped item. For Photos, drop a video (not a still photo).
ja: ドロップした項目を読み取れませんでした。写真アプリからは静止画ではなく動画をドロップしてください。

# status.joined %lld %@
source: Joined %lld video(s) → %@
ja: %lld 本の動画を結合しました → %@

# status.skip_one %@
source: Skipped drop — %@
ja: ドロップをスキップ — %@

# status.skip_many %lld %@
source: Skipped %lld dropped item(s) — %@
ja: %lld 件のドロップをスキップ — %@

# status.rejected
source: Rejected
ja: 拒否

# status.reference_unusable %@
source: Reference item unusable: %@
ja: 基準の項目が使えません: %@

# filter.not_file_url
source: Only file URLs can be added.
ja: ファイルの URL のみ追加できます。

# filter.not_a_file
source: Folders and non-file items are not supported.
ja: フォルダやファイル以外の項目はサポートしていません。

# filter.unsupported_type
source: Unsupported file type. Choose a movie file.
ja: 未対応のファイル形式です。動画ファイルを選んでください。

# panel.open.message
source: Select videos to join
ja: 結合する動画を選択

# panel.open.prompt
source: Add
ja: 追加

# panel.open.title
source: Add Videos
ja: 動画を追加

# panel.save.message
source: Choose output movie destination
ja: 出力先の動画を選択

# panel.save.prompt
source: Select
ja: 選択

# panel.save.title
source: Export Movie
ja: 動画を書き出し

# permission.movies.title %@
source: Allow access to %@?
ja: %@ へのアクセスを許可しますか？

# permission.movies.body %@
source: Movies Connector saves joined videos in: %@ Click Allow to create this folder and use it as the default output location.
ja: 結合した動画は次の場所に保存されます: %@ 「許可」を押すとこのフォルダを作成し、デフォルトの出力先として使います。

# permission.allow
source: Allow
ja: 許可

# permission.not_now
source: Not Now
ja: あとで

# permission.create_failed.title
source: Could not create the output folder
ja: 出力フォルダを作成できませんでした

# error.movies_unavailable
source: Could not locate the Movies folder.
ja: ムービーフォルダが見つかりません。

# error.access_denied %@
source: Could not access “%@”. Reselect the file in the open or save panel.
ja: 「%@」にアクセスできません。開く／保存パネルでファイルを選び直してください。

# error.icloud_download_failed %@ %@
source: Could not download “%@” from iCloud: %@
ja: 「%@」を iCloud からダウンロードできませんでした: %@

# error.icloud_unavailable %@
source: “%@” is not available locally. Download it from iCloud Drive and try again.
ja: 「%@」はローカルにありません。iCloud Drive からダウンロードして再度お試しください。

# error.icloud_timeout %@
source: Timed out while downloading “%@” from iCloud.
ja: 「%@」の iCloud ダウンロードがタイムアウトしました。

# error.export.empty
source: No input videos were provided.
ja: 入力動画がありません。

# error.export.output_collision
source: Output destination must not be the same file as any input.
ja: 出力先を入力ファイルと同じにはできません。

# error.export.incompatible %@
source: Inputs are incompatible for lossless join: %@
ja: ロスレス結合できない入力です: %@

# error.export.composition
source: Could not build the join composition.
ja: 結合用の構成を作成できませんでした。

# error.export.session
source: Could not start a passthrough export session.
ja: パススルー書き出しを開始できませんでした。

# error.export.failed %@
source: Export failed: %@
ja: 書き出しに失敗しました: %@

# error.export.disk_full
source: Not enough disk space to finish the export.
ja: 書き出しを完了するための空き容量が不足しています。

# error.export.cancelled
source: Export cancelled.
ja: 書き出しをキャンセルしました。

# ui.remove.a11y %@
source: Remove %@
ja: %@ を削除

# ui.progress.value %lld
source: %lld percent
ja: %lld パーセント

# ui.drop.cancel.help
source: Cancel this drop import
ja: このドロップの読み込みをキャンセル

# ui.drop.cancel.a11y %@
source: Cancel import of %@
ja: %@ の読み込みをキャンセル

# compat.topology %@
source: Unsupported track layout: %@
ja: 非対応のトラック構成: %@

# compat.video_track_count %lld %lld
source: Video track count mismatch (%1$lld vs %2$lld)
ja: ビデオトラック数が一致しません（%1$lld と %2$lld）

# compat.audio_track_count %lld %lld
source: Audio track count mismatch (%1$lld vs %2$lld)
ja: オーディオトラック数が一致しません（%1$lld と %2$lld）

# compat.video_codec %@ %@
source: Video codec mismatch (%1$@ vs %2$@)
ja: ビデオコーデックが一致しません（%1$@ と %2$@）

# compat.video_display_size %@ %@
source: Video display size mismatch (%1$@ vs %2$@)
ja: 表示サイズが一致しません（%1$@ と %2$@）

# compat.video_transform
source: Video preferred transform mismatch
ja: ビデオの変換行列が一致しません

# compat.video_frame_duration %@ %@
source: Video frame duration mismatch (%1$@ vs %2$@)
ja: フレーム時間が一致しません（%1$@ と %2$@）

# compat.video_timescale %@ %@
source: Video timescale mismatch (%1$@ vs %2$@)
ja: タイムスケールが一致しません（%1$@ と %2$@）

# compat.audio_codec %@ %@
source: Audio codec mismatch (%1$@ vs %2$@)
ja: オーディオコーデックが一致しません（%1$@ と %2$@）

# compat.audio_sample_rate %@ %@
source: Audio sample rate mismatch (%1$@ vs %2$@)
ja: サンプルレートが一致しません（%1$@ と %2$@）

# compat.audio_channel_count %@ %@
source: Audio channel count mismatch (%1$@ vs %2$@)
ja: チャンネル数が一致しません（%1$@ と %2$@）

# compat.audio_format_flags %@ %@
source: Audio format flags mismatch (%1$@ vs %2$@)
ja: オーディオ形式フラグが一致しません（%1$@ と %2$@）

# compat.asset_unsupported_tracks
source: Asset has unsupported tracks
ja: 非対応のトラックがあります

# compat.asset_video_track_count %lld
source: Asset must have exactly 1 video track (found %lld)
ja: ビデオトラックはちょうど 1 本である必要があります（%lld 本）

# compat.asset_audio_track_count %lld
source: Asset must have at most 1 audio track (found %lld)
ja: オーディオトラックは最大 1 本です（%lld 本）

# compat.reference_unavailable
source: Reference asset metadata is unavailable
ja: 基準アセットのメタデータがありません

# compat.cannot_compare_reference
source: Cannot compare: reference asset is unreadable
ja: 比較できません: 基準アセットを読めません

# compat.reference_unsupported_tracks
source: reference asset has unsupported tracks
ja: 基準アセットに非対応トラックがあります

# compat.candidate_unsupported_tracks
source: candidate asset has unsupported tracks
ja: 候補アセットに非対応トラックがあります

# compat.reference_video_track_count %lld
source: reference must have exactly 1 video track (found %lld)
ja: 基準はビデオトラック 1 本である必要があります（%lld 本）

# compat.candidate_video_track_count %lld
source: candidate must have exactly 1 video track (found %lld)
ja: 候補はビデオトラック 1 本である必要があります（%lld 本）

# compat.reference_audio_track_count %lld
source: reference must have at most 1 audio track (found %lld)
ja: 基準のオーディオトラックは最大 1 本です（%lld 本）

# compat.candidate_audio_track_count %lld
source: candidate must have at most 1 audio track (found %lld)
ja: 候補のオーディオトラックは最大 1 本です（%lld 本）
